app/Models/ModelKategori.php

    public function AllData()
    {
        return $this->db->table('tbl_kategori')
            ->orderBy('id_kategori', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kategori`
ORDER BY `id_kategori` DESC